
## Plan Result (aat)




<pre><code>Plan: 14 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;database&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;pass&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]
  * module.postgresql-staging[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql-staging[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql-staging[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql-staging[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql-staging[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;notifications&#34;]
  * module.postgresql-staging[0].azurerm_resource_group.rg[0]
  * module.postgresql-staging[0].null_resource.set-user-permissions-additionaldbs[&#34;notifications&#34;]
  * module.postgresql-staging[0].random_password.password
  * module.postgresql-staging[0].terraform_data.trigger_password_reset
* Update
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret_staging["database"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "notification-service-staging-db-flexible-database"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "notification-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "notification-service-staging-db-flexible-host"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "notification-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["pass"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "notification-service-staging-db-flexible-pass"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "notification-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "notification-service-staging-db-flexible-port"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "notification-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["user"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "notification-service-staging-db-flexible-user"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "notification-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-17T07:38:50Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-DATABASE/adaf4e6134264d9db8c61149923963cc"
        name                    = "notification-service-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-17T07:38:28Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-HOST/904c6b6ebabe485499655d99b69c1d77"
        name                    = "notification-service-POSTGRES-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-17T07:38:39Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-PASS/3e1a7294387d4d46b8b7abae51b6d53d"
        name                    = "notification-service-POSTGRES-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-17T07:38:58Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-PORT/a62439b8eb9646328de256c849503adc"
        name                    = "notification-service-POSTGRES-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-17T07:38:28Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-USER/2df05455a0cb4b5b8266b38ab5ada02d"
        name                    = "notification-service-POSTGRES-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # module.postgresql-staging[0].azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "notifier"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "reform-scan-notification-service-flexible-v15-staging-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "reform-scan-notification-service-flexible-v15-staging-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql-staging[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "reform-scan-notification-service-flexible-v15-staging-data-aat"
      + server_name         = "reform-scan-notification-service-flexible-v15-staging-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql-staging[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "reform-scan-notification-service-flexible-v15-staging-data-aat"
      + server_name         = "reform-scan-notification-service-flexible-v15-staging-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql-staging[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql-staging[0].azurerm_postgresql_flexible_server_database.pg_databases["notifications"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "notifications"
      + server_id = (known after apply)
    }

  # module.postgresql-staging[0].azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "reform-scan-notification-service-flexible-v15-staging-data-aat"
      + tags     = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
    }

  # module.postgresql-staging[0].null_resource.set-user-permissions-additionaldbs["notifications"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = ""
          + "name"           = "reform-scan-notification-service-flexible-v15-staging"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgresql-staging[0].random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.postgresql-staging[0].terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + output = (known after apply)
    }

Plan: 14 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1590,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->